app/controllers/posts_controller.rb

    def index
        @posts = Post.where(published: true)
        if !params[:search].nil? && params[:search].present?
            @posts = PostsSearchService.search(@posts, params[:search])
        end
        render json: @posts.includes(:user), status: :ok
---
SELECT "posts".* FROM "posts" WHERE "posts"."published" = $1  [["published", true]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]

    def create
        @post = Current.user.posts.create!(create_params)
---
INSERT INTO "posts" ("title", "content", "published", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        @post = Current.user.posts.find(params[:id])
        @post.update!(update_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 21], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "published" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "Actualizando peticion"], ["content", "Actualizando continido de la peticion"], ["published", false], ["updated_at", "2019-05-14 02:13:37.520816"], ["id", 21]]