app/controllers/concerns/secured.rb

    def authenticate_user!
        #Bearer  xxxx
        token_regex = /Bearer (\w+)/
        # read header to auth
        headers = request.headers
        #verificar que sea valido
        if headers['Authorization'].present? && headers['Authorization'].match(token_regex)
            token = headers['Authorization'].match(token_regex)[1];
            #verificar que el token que extraemos corresponda al token de un usuario
            #truthy falsy
            if (Current.user = User.find_by_auth_token(token))
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "fbbebd4e6e0f4039943fe32e37d74f27"], ["LIMIT", 1]]